# Pandas

In [1]:
import pandas as pd
import numpy as np

### 生成Pandas对象

Series

In [2]:
# 一维Series可用一维列表初始化
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
s.shape

(6,)

DataFrame

DateFrame是一个二维结构，这里首先构建一个时间序列，作为第一维的下标

In [5]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

默认情况，如果不指定index和column，则值将用从0开始的数字替代

除了向DataFrame 传入二维数组，也可以使用字典传入数据

In [7]:
df2 = pd.DataFrame({
    "a":1,
    "b":pd.Timestamp("20130101"),
    "c":pd.Series(1,index=list(range(4)),dtype="float32")
})
df2

   a          b    c
0  1 2013-01-01  1.0
1  1 2013-01-01  1.0
2  1 2013-01-01  1.0
3  1 2013-01-01  1.0

### 查看数据

头尾数据

head 和 tail 方法可以分别查看最前面几行和最后面几行的数据（默认为5）

In [8]:
df.head()

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420

In [9]:
df.tail()

                   A         B         C         D
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

### 下标，列标，数据

下标

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

列标

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

数据值

In [12]:
df.values

array([[ 1.35449255, -0.32212928,  0.36009183,  0.39834765],
       [-0.08090677,  0.93395307,  0.43691745,  0.28790887],
       [-0.73283262,  1.34206282,  1.74746289,  0.15379825],
       [ 1.23969584,  2.08557897, -0.36348149,  0.23084361],
       [ 0.07931252, -0.04029528,  1.0463533 ,  1.24241986],
       [-1.30469328, -1.06214382,  1.38560961,  0.32668735]])

### 排序

sort_index 方法按照下标大小排序，axis=0表示按照第0维排序

In [13]:
df

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

In [14]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06 -1.304693 -1.062144  1.385610  0.326687
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-01  1.354493 -0.322129  0.360092  0.398348

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.398348  0.360092 -0.322129  1.354493
2013-01-02  0.287909  0.436917  0.933953 -0.080907
2013-01-03  0.153798  1.747463  1.342063 -0.732833
2013-01-04  0.230844 -0.363481  2.085579  1.239696
2013-01-05  1.242420  1.046353 -0.040295  0.079313
2013-01-06  0.326687  1.385610 -1.062144 -1.304693

sort_values 按照 by 值的大小进行排序

In [16]:
df.sort_values(by="A")

                   A         B         C         D
2013-01-06 -1.304693 -1.062144  1.385610  0.326687
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-01  1.354493 -0.322129  0.360092  0.398348

In [17]:
df.sort_values(by="A", ascending=False)

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

### 索引

虽然 DataFrame 支持 Python/Numpy的索引语法，但是推荐使用 .at, .iat, .loc, .iloc 和 .ix 方法进行索引

In [18]:
# 读取数据
df['A']

2013-01-01    1.354493
2013-01-02   -0.080907
2013-01-03   -0.732833
2013-01-04    1.239696
2013-01-05    0.079313
2013-01-06   -1.304693
Freq: D, Name: A, dtype: float64

In [19]:
df.A

2013-01-01    1.354493
2013-01-02   -0.080907
2013-01-03   -0.732833
2013-01-04    1.239696
2013-01-05    0.079313
2013-01-06   -1.304693
Freq: D, Name: A, dtype: float64

In [20]:
# 使用切片读取多行
df[1:3]

                   A         B         C         D
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798

In [21]:
# 按名字进行切片
df["2013-01-03":"2013-01-06"]

                   A         B         C         D
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

#### 使用 label 进行索引 - loc

In [22]:
df.loc[:,'B']

2013-01-01   -0.322129
2013-01-02    0.933953
2013-01-03    1.342063
2013-01-04    2.085579
2013-01-05   -0.040295
2013-01-06   -1.062144
Freq: D, Name: B, dtype: float64

In [23]:
# 选择多行多列
df.loc["2013-01-02":"2013-01-05",["B","D"]]

                   B         D
2013-01-02  0.933953  0.287909
2013-01-03  1.342063  0.153798
2013-01-04  2.085579  0.230844
2013-01-05 -0.040295  1.242420

In [24]:
# 数据降维
df.loc["20130102",["A","C"]]

A   -0.080907
C    0.436917
Name: 2013-01-02 00:00:00, dtype: float64

In [25]:
# 直接获取标量值
df.loc["2013-01-05","A"]

0.07931252391232498

#### 使用位置索引 - iloc

In [26]:
df

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

In [27]:
df.iloc[1]

A   -0.080907
B    0.933953
C    0.436917
D    0.287909
Name: 2013-01-02 00:00:00, dtype: float64

连续切片

In [28]:
df.iloc[2:5, 1:3]

                   B         C
2013-01-03  1.342063  1.747463
2013-01-04  2.085579 -0.363481
2013-01-05 -0.040295  1.046353

索引不连续的部分

In [29]:
df.iloc[[1,3,5],[1,3]]

                   B         D
2013-01-02  0.933953  0.287909
2013-01-04  2.085579  0.230844
2013-01-06 -1.062144  0.326687

索引整行

In [30]:
df.iloc[2:4,:]

                   A         B         C         D
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844

索引整列

In [31]:
df.iloc[:,[1,3]]

                   B         D
2013-01-01 -0.322129  0.398348
2013-01-02  0.933953  0.287909
2013-01-03  1.342063  0.153798
2013-01-04  2.085579  0.230844
2013-01-05 -0.040295  1.242420
2013-01-06 -1.062144  0.326687

直接获取标量值

In [32]:
df.iloc[2,2]

1.7474628945866244

### 布尔型索引

In [33]:
df

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

In [34]:
# 获取 C 列大于0 的行
df[df.C > 0]

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

In [35]:
# 只留下所有大于0的数值
df[df>0]

                   A         B         C         D
2013-01-01  1.354493       NaN  0.360092  0.398348
2013-01-02       NaN  0.933953  0.436917  0.287909
2013-01-03       NaN  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579       NaN  0.230844
2013-01-05  0.079313       NaN  1.046353  1.242420
2013-01-06       NaN       NaN  1.385610  0.326687

In [36]:
# 使用 isin 方法做 filter 过滤
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

In [37]:
df2.iloc[2,2] = 0.666666
df2

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  0.666666  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

In [38]:
df

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

In [39]:
df2["e"] = ["one",'two',"three","four","five","six"]
df2

                   A         B         C         D      e
2013-01-01  1.354493 -0.322129  0.360092  0.398348    one
2013-01-02 -0.080907  0.933953  0.436917  0.287909    two
2013-01-03 -0.732833  1.342063  0.666666  0.153798  three
2013-01-04  1.239696  2.085579 -0.363481  0.230844   four
2013-01-05  0.079313 -0.040295  1.046353  1.242420   five
2013-01-06 -1.304693 -1.062144  1.385610  0.326687    six

In [40]:
df2[df2["e"].isin(["one","three","five"])]

                   A         B         C         D      e
2013-01-01  1.354493 -0.322129  0.360092  0.398348    one
2013-01-03 -0.732833  1.342063  0.666666  0.153798  three
2013-01-05  0.079313 -0.040295  1.046353  1.242420   five

### 设定数据的值

In [41]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range("20130101",periods=6))
s1

2013-01-01    1
2013-01-02    2
2013-01-03    3
2013-01-04    4
2013-01-05    5
2013-01-06    6
Freq: D, dtype: int64

In [42]:
df

                   A         B         C         D
2013-01-01  1.354493 -0.322129  0.360092  0.398348
2013-01-02 -0.080907  0.933953  0.436917  0.287909
2013-01-03 -0.732833  1.342063  1.747463  0.153798
2013-01-04  1.239696  2.085579 -0.363481  0.230844
2013-01-05  0.079313 -0.040295  1.046353  1.242420
2013-01-06 -1.304693 -1.062144  1.385610  0.326687

In [43]:
df["F"] = s1
df

                   A         B         C         D  F
2013-01-01  1.354493 -0.322129  0.360092  0.398348  1
2013-01-02 -0.080907  0.933953  0.436917  0.287909  2
2013-01-03 -0.732833  1.342063  1.747463  0.153798  3
2013-01-04  1.239696  2.085579 -0.363481  0.230844  4
2013-01-05  0.079313 -0.040295  1.046353  1.242420  5
2013-01-06 -1.304693 -1.062144  1.385610  0.326687  6

使用 at 或者 iat 修改单个值

In [44]:
df.iloc[3,-1] = 8
df

                   A         B         C         D  F
2013-01-01  1.354493 -0.322129  0.360092  0.398348  1
2013-01-02 -0.080907  0.933953  0.436917  0.287909  2
2013-01-03 -0.732833  1.342063  1.747463  0.153798  3
2013-01-04  1.239696  2.085579 -0.363481  0.230844  8
2013-01-05  0.079313 -0.040295  1.046353  1.242420  5
2013-01-06 -1.304693 -1.062144  1.385610  0.326687  6

In [45]:
df.at[dates[3],"F"] = 9
df

                   A         B         C         D  F
2013-01-01  1.354493 -0.322129  0.360092  0.398348  1
2013-01-02 -0.080907  0.933953  0.436917  0.287909  2
2013-01-03 -0.732833  1.342063  1.747463  0.153798  3
2013-01-04  1.239696  2.085579 -0.363481  0.230844  9
2013-01-05  0.079313 -0.040295  1.046353  1.242420  5
2013-01-06 -1.304693 -1.062144  1.385610  0.326687  6

### 计算操作

每一列的均值 (默认都是计算列)

In [46]:
df

                   A         B         C         D  F
2013-01-01  1.354493 -0.322129  0.360092  0.398348  1
2013-01-02 -0.080907  0.933953  0.436917  0.287909  2
2013-01-03 -0.732833  1.342063  1.747463  0.153798  3
2013-01-04  1.239696  2.085579 -0.363481  0.230844  9
2013-01-05  0.079313 -0.040295  1.046353  1.242420  5
2013-01-06 -1.304693 -1.062144  1.385610  0.326687  6

In [47]:
df.mean()

A    0.092511
B    0.489504
C    0.768826
D    0.440001
F    4.333333
dtype: float64

In [48]:
df.mean(axis=1)

2013-01-01    0.558161
2013-01-02    0.715575
2013-01-03    1.102098
2013-01-04    2.438527
2013-01-05    1.465558
2013-01-06    1.069092
Freq: D, dtype: float64

### 合并操作

#### 连接

In [49]:
df = pd.DataFrame(np.random.randn(10,4))

In [50]:
df

          0         1         2         3
0  0.058312 -0.635674  0.026938 -0.037370
1 -0.237358 -0.413015 -0.558648  0.529533
2  0.526878 -0.964944  0.308930  0.242833
3 -0.557526  0.642577  1.153592 -2.187862
4  2.439254 -1.403200  0.566686 -1.168231
5  0.025062 -1.700577  0.465125 -0.697342
6 -0.389664  0.205015  0.253797 -0.712028
7  0.896758 -0.279155  1.570913  0.022613
8  1.048824 -0.153522  1.800595  1.569588
9  0.701642 -2.156597 -0.371986 -0.556915

也可以使用 pd.concat 将多个 pandas 对象进行连接

In [52]:
pieces = [df[:2],df[4:5],df[7:]]
pieces

[          0         1         2         3
 0  0.058312 -0.635674  0.026938 -0.037370
 1 -0.237358 -0.413015 -0.558648  0.529533,
           0       1         2         3
 4  2.439254 -1.4032  0.566686 -1.168231,
           0         1         2         3
 7  0.896758 -0.279155  1.570913  0.022613
 8  1.048824 -0.153522  1.800595  1.569588
 9  0.701642 -2.156597 -0.371986 -0.556915]

In [53]:
pd.concat(pieces)

          0         1         2         3
0  0.058312 -0.635674  0.026938 -0.037370
1 -0.237358 -0.413015 -0.558648  0.529533
4  2.439254 -1.403200  0.566686 -1.168231
7  0.896758 -0.279155  1.570913  0.022613
8  1.048824 -0.153522  1.800595  1.569588
9  0.701642 -2.156597 -0.371986 -0.556915

数据库中的Join

merge 可以实现数据库中的 join 操作

In [55]:
left = pd.DataFrame({"key":["foo","foo"], "lval":[1,2]})
right = pd.DataFrame({"key":["foo","foo"], "rval":[4,5]})

print(left)
print(right)
print(type(left))
print(type(right))

   key  lval
0  foo     1
1  foo     2
   key  rval
0  foo     4
1  foo     5
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [56]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### append

向 DataFrame 中添加行

In [58]:
# np.random.randn(x,y) 生成一个 x 行 y 列的数组
df = pd.DataFrame(np.random.randn(8,4), columns=["A","B","C","D"])
df

          A         B         C         D
0  0.459643 -0.378127 -1.062132 -1.138199
1 -0.095095  0.350394 -0.231968 -1.590776
2 -1.967441 -0.275402  1.043646 -0.020758
3  1.685108  0.341329 -0.601349 -0.123905
4  0.560273 -0.413988 -0.531212 -1.229444
5  0.771256 -0.998426 -1.678794 -0.772468
6  0.823599 -0.765494  1.135680 -1.112937
7  0.078997  0.036722 -1.778946  0.054995

将第三行的值添加到最后

In [59]:
df.iloc[3]

A    1.685108
B    0.341329
C   -0.601349
D   -0.123905
Name: 3, dtype: float64

In [60]:
df.append(df.iloc[3])

AttributeError: 'DataFrame' object has no attribute 'append'

In [63]:
pd.concat([df,df.iloc[3]],axis=1)

          A         B         C         D         3
0  0.459643 -0.378127 -1.062132 -1.138199       NaN
1 -0.095095  0.350394 -0.231968 -1.590776       NaN
2 -1.967441 -0.275402  1.043646 -0.020758       NaN
3  1.685108  0.341329 -0.601349 -0.123905       NaN
4  0.560273 -0.413988 -0.531212 -1.229444       NaN
5  0.771256 -0.998426 -1.678794 -0.772468       NaN
6  0.823599 -0.765494  1.135680 -1.112937       NaN
7  0.078997  0.036722 -1.778946  0.054995       NaN
A       NaN       NaN       NaN       NaN  1.685108
B       NaN       NaN       NaN       NaN  0.341329
C       NaN       NaN       NaN       NaN -0.601349
D       NaN       NaN       NaN       NaN -0.123905

In [64]:
df

          A         B         C         D
0  0.459643 -0.378127 -1.062132 -1.138199
1 -0.095095  0.350394 -0.231968 -1.590776
2 -1.967441 -0.275402  1.043646 -0.020758
3  1.685108  0.341329 -0.601349 -0.123905
4  0.560273 -0.413988 -0.531212 -1.229444
5  0.771256 -0.998426 -1.678794 -0.772468
6  0.823599 -0.765494  1.135680 -1.112937
7  0.078997  0.036722 -1.778946  0.054995

In [65]:
df.iloc[3]

A    1.685108
B    0.341329
C   -0.601349
D   -0.123905
Name: 3, dtype: float64